<?php
return [
    'status_0' =>'操作失败',
    'status_20000' =>'操作成功',
  
    'error_10000001'=>'Oauth应用app_id为空',
    'error_10000002'=>'Oauth应用app_secret为空',
    'error_10000003'=>'Oauth应用授权session_key为空',
    'error_10000004'=>'Oauth应用名称为空',
    'error_10000005'=>'非法Oauth应用安全域名',
    'error_10000006'=>'非法Oauth应用用户账号所需字段',
    'error_10000007'=>'非法Oauth应用授权URI',
    'error_10000008'=>'非法Oauth应用授权类型',
    'error_10000009'=>'非法Oauth应用权限',
    'error_10000010'=>'非法Oauth应用user_id',
    'error_10000011'=>'非法Oauth应用状态',
    'error_10000012'=>'非法Oauth应用状态',
  
    'error_10000013'=>'该Oauth应用已存在',
    'error_10000014'=>'该oauth应用不存在',
    'error_10000015'=>'非法OAuth应用scope',
    'error_10000016'=>'生成oauth应用密钥失败',
    'error_10000017'=>'设置oauth密钥失败',
    'error_10000018'=>'重置oauth密钥失败',
    'error_10000019'=>'重置oauth应用session_key失败',
  
    'error_10000020'=>'用户在Oauth应用中的openid为空',
    'error_10000021'=>'第三方Oauth应用中的用户账号为空',
    'error_10000022'=>'非法的第三方Oauth应用中的用户账号信息详情',
    'error_10000023'=>'非法Oauth应用用户状态',
  
    'error_10000024'=>'第三方Oauth应用中的用户账号信息为空',
    'error_10000025'=>'该Oauth应用下该openid已存在',
    'error_10000026'=>'该Oauth应用下该用户账号已存在',
    'error_10000027'=>'用户账户字段 %s 为空',
    'error_10000028'=>'添加新oauth用户失败',
  
    'error_10000029'=>'Oauth授权权限为空',
    'error_10000030'=>'非法Oauth授权权限默认状态',
    'error_10000031'=>'非法Oauth授权权限类型',
    'error_10000032'=>'非法Oauth授权所属模块',
  
    'error_10000033'=>'该Oauth授权权限已存在',
    'error_10000034'=>'模块 %s 不在允许的模块列表中',
  
    'error_10000035'=>'签名验证失败',
  
    'error_10000036'=>'该Oauth应用下的第三方用户信息为空',
    'error_10000037'=>'该Oauth应用下的第三方用户信息非法',
    'error_10000038'=>'该Oauth应用下的该第三方用户账号为空',
    'error_10000039'=>'该Oauth应用下该第三方用户账号已存在',
  
    'error_10000040'=>'该Oauth账户绑定邮箱已存在',
  
    'error_10000041'=>'非法scope',
  
    'error_10000042'=>'该Oauth授权账户不存在',
    'error_10000043'=>'该Oauth授权账户密码为空',
    'error_10000044'=>'该Oauth授权账户所有者名字为空',
    'error_10000045'=>'该Oauth授权账户所有者姓氏为空',
    'error_10000046'=>'该Oauth授权账户所有者邮箱非法',
    'error_10000047'=>'该Oauth授权账户所有者邮箱验证状态非法',
    'error_10000048'=>'该Oauth授权账户权限为空',
  
    'error_10000049'=>'该Oauth授权权限不存在',

    'error_10000050'=>'非法的Oauth应用回调授权需求状态',
    'error_10000051'=>'Oauth应用回调授权域名为空',
    'error_10000052'=>'非法的Oauth应用回调授权域名ssl支持状态',

    /*  域名IP相关  */
    'error_10000101'=>'域名为空',
    'error_10000102'=>'域名级别为空',
    'error_10000103'=>'域名级别必须为数字',
    'error_10000104'=>'对应的顶级域名为空',
    'error_10000105'=>'对应的上级域名为空',
    'error_10000106'=>'对应的域名后缀为空',
    'error_10000107'=>'手动设置的IP为空',
    'error_10000108'=>'IP为空',
    'error_10000109'=>'数字IP不合法',
    'error_10000110'=>'IPv6为空',
    'error_10000111'=>'数字IP（IPv6）不合法',
    'error_10000112'=>'域名ip手动状态不合法',
    'error_10000113'=>'域名状态不合法',
];

